content/posts-org/interview-notes-Chaitanya.org
#+hugo_base_dir: ../../
# -*- mode: org; coding: utf-8; -*-
* Header Information                                               :noexport:
#+LaTeX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER: \usepackage{helvetica}
#+LATEX_HEADER: \setlength{\textwidth}{5.1in} % set width of text portion
#+LATEX_HEADER: \usepackage{geometry}
#+TITLE:     Interview with Chaitanya
#+AUTHOR:    Fei Ni
#+EMAIL:     fei.ni@helix.com
#+DATE:      2021-01-01
#+HUGO_CATEGORIES: helix
#+HUGO_tags: helix
#+hugo_auto_set_lastmod: t
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   ^:{}
#+INFOJS_OPT: view:nil toc:nil ltoc:nil mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+HTML_HEAD: <link rel="stylesheet" href="org.css" type="text/css"/>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+STARTUP: hidestars

#+STARTUP: overview   (or: showall, content, showeverything)
http://orgmode.org/org.html#Visibility-cycling  info:org#Visibility cycling

#+TODO: TODO(t) NEXT(n) STARTED(s) WAITING(w@/!) SOMEDAY(S!) | DONE(d!/!) CANCELLED(c@/!)
http://orgmode.org/org.html#Per_002dfile-keywords  info:org#Per-file keywords

#+TAGS: important(i) private(p)
#+TAGS: @HOME(h) @OFFICE(o)
http://orgmode.org/org.html#Setting-tags  info:org#Setting tags

#+NOstartup: beamer
#+NOLaTeX_CLASS: beamer
#+NOLaTeX_CLASS_OPTIONS: [bigger]
#+NOBEAMER_FRAME_LEVEL: 2


# Start from here


* Basic Info

| Candidate Name | Chaitanya Guttula    |
| Job Level      | Senior               |
| Type           | Tech phone screening |
| Date           | 06/03/2021           |

Coderpad link: https://app.coderpad.io/C9KH94J4


* timeline

|  Time | activity                                                             |
| 12:00 | Interview started                                                    |
| 12:10 | Switch to coding challenge                                           |
| 12:22 | Start coding                                                         |
| 13:05 | Stop the session, still not be able to complete the coding           |




* General notes

Pros: 
  - Talking about a recent troubleshooting experience(email cannot be sent out), he can explain the whole process crossing different components clearly 
    - sender side
    - receiver side
    - OS layer
    - Library (jar) layer
  - Asked some corner cases for clarification 
    - How about empty string
    - How about a string like "Quickly"
  - Before coding, he read and thought about all the rules, and gave basic idea for the solution
Cons:
  - Tried to use regex, but looks like not very familiar with it , took a long time to make it working
  - Not be able to complete the coding in time, code is not in runnable state
  - Don't have time to talk about how to test it
 
