content/posts/interview-notes-Chaitanya.md
+++
title = "Interview with Chaitanya"
author = ["Fei Ni"]
date = 2021-07-12T10:34:12-07:00
lastmod = 2021-07-12T10:34:12-07:00
tags = ["helix"]
categories = ["helix"]
draft = false
+++

## <span class="section-num">1</span> Basic Info {#basic-info}

| Candidate Name | Chaitanya Guttula    |
|----------------|----------------------|
| Job Level      | Senior               |
| Type           | Tech phone screening |
| Date           | 06/03/2021           |

Coderpad link: <https://app.coderpad.io/C9KH94J4>


## <span class="section-num">2</span> timeline {#timeline}

| Time  | activity                                                   |
|-------|------------------------------------------------------------|
| 12:00 | Interview started                                          |
| 12:10 | Switch to coding challenge                                 |
| 12:22 | Start coding                                               |
| 13:05 | Stop the session, still not be able to complete the coding |


## <span class="section-num">3</span> General notes {#general-notes}

Pros:

-   Talking about a recent troubleshooting experience(email cannot be sent out), he can explain the whole process crossing different components clearly
    -   sender side
    -   receiver side
    -   OS layer
    -   Library (jar) layer
-   Asked some corner cases for clarification
    -   How about empty string
    -   How about a string like "Quickly"
-   Before coding, he read and thought about all the rules, and gave basic idea for the solution

Cons:

-   Tried to use regex, but looks like not very familiar with it , took a long time to make it working
-   Not be able to complete the coding in time, code is not in runnable state
-   Don't have time to talk about how to test it
